-- phpMyAdmin SQL Dump
-- version 4.7.5
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Фев 15 2025 г., 18:16
-- Версия сервера: 10.1.36-MariaDB
-- Версия PHP: 7.2.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `wincc`
--

-- --------------------------------------------------------

--
-- Структура таблицы `data`
--

CREATE TABLE `data` (
  `ID` int(10) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Parameter` decimal(10,2) NOT NULL,
  `Dates` varchar(17) NOT NULL DEFAULT '0000-00-00',
  `Times` varchar(17) NOT NULL DEFAULT '00:00:00'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `data`
--

INSERT INTO `data` (`ID`, `Name`, `Parameter`, `Dates`, `Times`) VALUES
(2352, 'Температура у приміщенні барбершопу', '17.98', '15.02.2025', '17:15:31'),
(2353, 'Температура у приміщенні барбершопу', '18.76', '15.02.2025', '17:15:35'),
(2354, 'Температура у приміщенні барбершопу', '19.54', '15.02.2025', '17:15:40'),
(2355, 'Температура у приміщенні барбершопу', '20.29', '15.02.2025', '17:15:44'),
(2356, 'Температура у приміщенні барбершопу', '21.01', '15.02.2025', '17:15:50'),
(2357, 'Температура у приміщенні барбершопу', '21.66', '15.02.2025', '17:15:55'),
(2358, 'Температура у приміщенні барбершопу', '22.24', '15.02.2025', '17:16:01'),
(2359, 'Температура у приміщенні барбершопу', '22.77', '15.02.2025', '17:16:06'),
(2360, 'Температура у приміщенні барбершопу', '23.20', '15.02.2025', '17:16:13'),
(2361, 'Температура у приміщенні барбершопу', '23.57', '15.02.2025', '17:16:19'),
(2362, 'Температура у приміщенні барбершопу', '23.86', '15.02.2025', '17:16:26'),
(2363, 'Температура у приміщенні барбершопу', '24.07', '15.02.2025', '17:16:33'),
(2364, 'Температура у приміщенні барбершопу', '24.22', '15.02.2025', '17:16:40'),
(2365, 'Температура у приміщенні барбершопу', '24.32', '15.02.2025', '17:16:48'),
(2366, 'Температура у приміщенні барбершопу', '24.35', '15.02.2025', '17:16:55'),
(2367, 'Температура у приміщенні барбершопу', '24.35', '15.02.2025', '17:17:01'),
(2368, 'Температура у приміщенні барбершопу', '24.30', '15.02.2025', '17:17:08'),
(2369, 'Температура у приміщенні барбершопу', '24.22', '15.02.2025', '17:17:14'),
(2370, 'Температура у приміщенні барбершопу', '24.13', '15.02.2025', '17:17:19'),
(2371, 'Температура у приміщенні барбершопу', '24.01', '15.02.2025', '17:17:25'),
(2372, 'Температура у приміщенні барбершопу', '23.88', '15.02.2025', '17:17:30'),
(2373, 'Температура у приміщенні барбершопу', '23.75', '15.02.2025', '17:17:35'),
(2374, 'Температура у приміщенні барбершопу', '23.62', '15.02.2025', '17:17:39'),
(2375, 'Температура у приміщенні барбершопу', '23.49', '15.02.2025', '17:17:44'),
(2376, 'Температура у приміщенні барбершопу', '23.37', '15.02.2025', '17:17:48'),
(2377, 'Температура у приміщенні барбершопу', '23.25', '15.02.2025', '17:17:52'),
(2378, 'Температура у приміщенні барбершопу', '23.15', '15.02.2025', '17:17:55'),
(2379, 'Температура у приміщенні барбершопу', '23.06', '15.02.2025', '17:17:59'),
(2380, 'Температура у приміщенні барбершопу', '22.98', '15.02.2025', '17:18:02'),
(2381, 'Температура у приміщенні барбершопу', '22.92', '15.02.2025', '17:18:05'),
(2382, 'Температура у приміщенні барбершопу', '22.87', '15.02.2025', '17:18:09'),
(2383, 'Температура у приміщенні барбершопу', '22.83', '15.02.2025', '17:18:13'),
(2384, 'Температура у приміщенні барбершопу', '22.80', '15.02.2025', '17:18:17'),
(2385, 'Температура у приміщенні барбершопу', '22.78', '15.02.2025', '17:18:20'),
(2386, 'Температура у приміщенні барбершопу', '22.77', '15.02.2025', '17:18:25'),
(2387, 'Температура у приміщенні барбершопу', '22.77', '15.02.2025', '17:18:29'),
(2388, 'Температура у приміщенні барбершопу', '22.78', '15.02.2025', '17:18:34'),
(2389, 'Температура у приміщенні барбершопу', '22.79', '15.02.2025', '17:18:39'),
(2390, 'Температура у приміщенні барбершопу', '22.80', '15.02.2025', '17:18:44'),
(2391, 'Температура у приміщенні барбершопу', '22.82', '15.02.2025', '17:18:49'),
(2392, 'Температура у приміщенні барбершопу', '22.84', '15.02.2025', '17:18:55'),
(2393, 'Температура у приміщенні барбершопу', '22.87', '15.02.2025', '17:19:01'),
(2394, 'Температура у приміщенні барбершопу', '22.89', '15.02.2025', '17:19:07'),
(2395, 'Температура у приміщенні барбершопу', '22.91', '15.02.2025', '17:19:13'),
(2396, 'Температура у приміщенні барбершопу', '22.93', '15.02.2025', '17:19:20'),
(2397, 'Температура у приміщенні барбершопу', '22.95', '15.02.2025', '17:19:27'),
(2398, 'Температура у приміщенні барбершопу', '22.97', '15.02.2025', '17:19:35'),
(2399, 'Температура у приміщенні барбершопу', '22.99', '15.02.2025', '17:19:42'),
(2400, 'Температура у приміщенні барбершопу', '23.00', '15.02.2025', '17:19:49'),
(2401, 'Температура у приміщенні барбершопу', '23.01', '15.02.2025', '17:19:56'),
(2402, 'Температура у приміщенні барбершопу', '23.02', '15.02.2025', '17:20:02'),
(2403, 'Температура у приміщенні барбершопу', '23.03', '15.02.2025', '17:20:08'),
(2404, 'Температура у приміщенні барбершопу', '23.03', '15.02.2025', '17:20:14'),
(2405, 'Температура у приміщенні барбершопу', '23.04', '15.02.2025', '17:20:19'),
(2406, 'Температура у приміщенні барбершопу', '23.04', '15.02.2025', '17:20:24'),
(2407, 'Температура у приміщенні барбершопу', '23.04', '15.02.2025', '17:20:29'),
(2408, 'Температура у приміщенні барбершопу', '23.04', '15.02.2025', '17:20:33'),
(2409, 'Температура у приміщенні барбершопу', '23.04', '15.02.2025', '17:20:38'),
(2410, 'Температура у приміщенні барбершопу', '23.03', '15.02.2025', '17:20:42'),
(2411, 'Температура у приміщенні барбершопу', '23.03', '15.02.2025', '17:20:46'),
(2309, 'Температура у приміщенні барбершопу', '15.00', '15.02.2025', '17:06:55'),
(2310, 'Температура у приміщенні барбершопу', '15.05', '15.02.2025', '17:07:51'),
(2311, 'Температура у приміщенні барбершопу', '15.31', '15.02.2025', '17:07:58'),
(2312, 'Температура у приміщенні барбершопу', '15.76', '15.02.2025', '17:08:04'),
(2313, 'Температура у приміщенні барбершопу', '16.34', '15.02.2025', '17:08:11'),
(2314, 'Температура у приміщенні барбершопу', '17.01', '15.02.2025', '17:08:18'),
(2315, 'Температура у приміщенні барбершопу', '17.77', '15.02.2025', '17:08:24'),
(2316, 'Температура у приміщенні барбершопу', '18.54', '15.02.2025', '17:08:31'),
(2317, 'Температура у приміщенні барбершопу', '19.32', '15.02.2025', '17:08:36'),
(2318, 'Температура у приміщенні барбершопу', '20.08', '15.02.2025', '17:08:42'),
(2319, 'Температура у приміщенні барбершопу', '20.82', '15.02.2025', '17:08:47'),
(2320, 'Температура у приміщенні барбершопу', '21.48', '15.02.2025', '17:08:52'),
(2321, 'Температура у приміщенні барбершопу', '22.09', '15.02.2025', '17:08:57'),
(2322, 'Температура у приміщенні барбершопу', '22.63', '15.02.2025', '17:09:01'),
(2323, 'Температура у приміщенні барбершопу', '23.09', '15.02.2025', '17:09:06'),
(2324, 'Температура у приміщенні барбершопу', '23.47', '15.02.2025', '17:09:10'),
(2325, 'Температура у приміщенні барбершопу', '23.78', '15.02.2025', '17:09:13'),
(2326, 'Температура у приміщенні барбершопу', '24.02', '15.02.2025', '17:09:17'),
(2327, 'Температура у приміщенні барбершопу', '24.19', '15.02.2025', '17:09:20'),
(2328, 'Температура у приміщенні барбершопу', '24.29', '15.02.2025', '17:09:24'),
(2329, 'Температура у приміщенні барбершопу', '24.35', '15.02.2025', '17:09:28'),
(2330, 'Температура у приміщенні барбершопу', '24.35', '15.02.2025', '17:09:31'),
(2331, 'Температура у приміщенні барбершопу', '24.32', '15.02.2025', '17:09:35'),
(2332, 'Температура у приміщенні барбершопу', '24.25', '15.02.2025', '17:09:39'),
(2333, 'Температура у приміщенні барбершопу', '24.16', '15.02.2025', '17:09:44'),
(2334, 'Температура у приміщенні барбершопу', '24.04', '15.02.2025', '17:09:49'),
(2335, 'Температура у приміщенні барбершопу', '23.92', '15.02.2025', '17:09:53'),
(2336, 'Температура у приміщенні барбершопу', '23.79', '15.02.2025', '17:09:58'),
(2337, 'Температура у приміщенні барбершопу', '23.66', '15.02.2025', '17:10:04'),
(2338, 'Температура у приміщенні барбершопу', '23.53', '15.02.2025', '17:10:09'),
(2339, 'Температура у приміщенні барбершопу', '23.40', '15.02.2025', '17:10:15'),
(2340, 'Температура у приміщенні барбершопу', '23.29', '15.02.2025', '17:10:21'),
(2341, 'Температура у приміщенні барбершопу', '23.18', '15.02.2025', '17:10:28'),
(2342, 'Температура у приміщенні барбершопу', '23.08', '15.02.2025', '17:10:35'),
(2343, 'Температура у приміщенні барбершопу', '23.00', '15.02.2025', '17:10:42'),
(2344, 'Температура у приміщенні барбершопу', '22.94', '15.02.2025', '17:10:49'),
(2345, 'Температура у приміщенні барбершопу', '22.88', '15.02.2025', '17:10:57'),
(2346, 'Температура у приміщенні барбершопу', '15.00', '15.02.2025', '17:13:52'),
(2347, 'Температура у приміщенні барбершопу', '15.10', '15.02.2025', '17:15:12'),
(2348, 'Температура у приміщенні барбершопу', '15.41', '15.02.2025', '17:15:15'),
(2349, 'Температура у приміщенні барбершопу', '15.91', '15.02.2025', '17:15:19'),
(2350, 'Температура у приміщенні барбершопу', '16.52', '15.02.2025', '17:15:23'),
(2351, 'Температура у приміщенні барбершопу', '17.22', '15.02.2025', '17:15:26');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `data`
--
ALTER TABLE `data`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `data`
--
ALTER TABLE `data`
  MODIFY `ID` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2412;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
